InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РегламентныеПроцедуры/Ext/Module.bsl
Процедура ОбновлениеИндекса() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СлияниеИндексов() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеКурсовВалют() Экспорт
	
	// Получаем список валют, используемых в нашей конфигурации
	СписокВалют = РаботаСВалютой.ПолучитьСписокВалют();
	
	// Получаем актуальные курсы валют из веб-сервиса Центробанка РФ
	КурсыВалют = РаботаСВалютой.ПолучитьАктуальныеКурсыВалют();
	
	Если КурсыВалют = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Записываем актуальные курсы валют в регистр сведений
	НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
	Дата = ТекущаяДата();
	
	Для Каждого КурсВалюты из КурсыВалют Цикл
		
		КодВалютыСтрока = СокрЛП(КурсВалюты.VchCode);
		
		Для Каждого Валюта Из СписокВалют Цикл
			
			Если Валюта.Код = КодВалютыСтрока Тогда
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = Дата;
				НоваяЗапись.Валюта = Валюта.Ссылка;
				НоваяЗапись.Курс = КурсВалюты.Vcurs;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
